# RemoveDocumentTriggers Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterRegistry..::..RemoveDocumentTriggers Method
UpdaterRegistry Class See Also
---
Removes all triggers associated with specified document and Updater Does not unregister updater.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static void RemoveDocumentTriggers(
	UpdaterId id,
	Document document
)
```

Visual Basic
---
```text
Public Shared Sub RemoveDocumentTriggers ( _
	id As UpdaterId, _
	document As Document _
)
```

Visual C++
---
```text
public:
static void RemoveDocumentTriggers(
	UpdaterId^ id,
	Document^ document
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..UpdaterId Id of specified updater
document
    Type: Autodesk.Revit.DB..::..Document Document for which to remove triggers
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The updater's owner's AddIn does not match the currently active AddIn. -or- RemoveDocumentTriggers called while executing an updater. |

# See Also
UpdaterRegistry Class
Autodesk.Revit.DB Namespace